week2/sysbench.output
c6s2@c6s2-P7xxTM:~/tidb-hp-homeworkds/week2$ sh run-sysbench.sh 
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Creating table 'sbtest'...
ALERT: failed to execute MySQL query: `CREATE TABLE sbtest (id INTEGER UNSIGNED NOT NULL AUTO_INCREMENT, k integer UNSIGNED DEFAULT '0' NOT NULL, c char(120) DEFAULT '' NOT NULL, pad char(60) DEFAULT '' NOT NULL, PRIMARY KEY  (id) )  /*! ENGINE=innodb */`:
ALERT: Error 1050 Table 'test.sbtest' already exists
FATAL: failed to create test table
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 3

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            40004
        write:                           50003
        other:                           20001
        total:                           110008
    transactions:                        10000  (84.13 per sec.)
    deadlocks:                           1      (0.01 per sec.)
    read/write requests:                 90007  (757.24 per sec.)
    other operations:                    20001  (168.27 per sec.)

Test execution summary:
    total time:                          118.8626s
    total number of events:              10000
    total time taken by event execution: 356.4923
    per-request statistics:
         min:                                 13.92ms
         avg:                                 35.65ms
         max:                                336.35ms
         approx.  95 percentile:              56.69ms

Threads fairness:
    events (avg/stddev):           3333.3333/1.25
    execution time (avg/stddev):   118.8308/0.01

c6s2@c6s2-P7xxTM:~/tidb-hp-homeworkds/week2$